package com.tct.three;

/**
 * TCT 3번 문제
 * @author nam
 * 
 * 1. 현재 측정소의 좌표를 찾으시오
 * 2. 현재 측정소를 제외한 나머지 측정소들을 찾고, 해당 측정소까지 최단거리를 구하시오
 * 3. 가중치를 계산하여 현재 측정소의 미세먼지 농도를 구하시오
 */
public class CalculateDust {

	public static int[][] dustMap(){
		
		/*
		 * 현재 측정소=1, 미세먼지 측정소>1 (해당장소의 미세먼지 농도), 나머지=0
		 * 
		 * 0  0  0  0  0  90 0
		 * 0  0  1  0  0  0  0
		 * 0  0  0  0  50 0  0
		 * 10 0  0  0  0  0  0
		 * 0  0  79 0  0  0  0
		 * 0  0  0  0  0  0  0
		 * 0  33 0  0  0  0  0
		 * 
		 */

		// 최단거리는 가로거리 절대값 + 세로거리 절대값  
		
		return null;
	}
}
